package com.brunoyam.lessons.lesson9.abstractclasses;
// TODO Наследование - процесс при котором подклассы наследуют свойства и методы суперкласса, а
//  также могут иметь свои дополнительные
// extends - слово которое пишут после имени класса перед фигурными скобками для того чтобы указать от какого класса
// наследуются
// Полиморфизм - один метод и несколько реализаций.

// Абстракция - Абстра́кция — процесс отвлечения (абстрагирования) от тех или иных характеристик объекта
public class Main {
    public static void main(String[] args) {
        Animal animal =  new Cat();
        animal.say();

        animal = new Duck();
        animal.say();

    }
}
